// قائمة المواد الثابتة
const List<String> materialList = [
  'حديد',
  'اسمنت',
  'رمل',
  'طوب',
  'بلاستيك',
  'دهان',
  'بلاط',
  'سيراميك',
  'خشب',
  'مسامير',
  'زجاج',
  'المنيوم',
];

// وحدات القياس لكل مادة
const Map<String, String> materialUnit = {
  'حديد': 'طن',
  'اسمنت': 'كيس',
  'رمل': 'متر مكعب',
  'طوب': 'ألف طوبة',
  'بلاستيك': 'متر',
  'دهان': 'علبة',
  'بلاط': 'متر مربع',
  'سيراميك': 'متر مربع',
  'خشب': 'متر',
  'مسامير': 'كيلو',
  'زجاج': 'متر مربع',
  'المنيوم': 'متر',
};

const String companyName = 'شركة العجاج لأدوات البناء';
const String managerName = 'إدارة ملحم العجاج ابو عويد';
const String contactPhone = '0930847972';
const String currencySymbol = '\$';